{
  "_name_or_path": "model/finer-debt-distilbert-cased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-DebtInstrumentBasisSpreadOnVariableRate1",
    "2": "B-DebtInstrumentInterestRateStatedPercentage",
    "3": "B-LineOfCreditFacilityMaximumBorrowingCapacity",
    "4": "B-DebtInstrumentInterestRateEffectivePercentage"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DebtInstrumentBasisSpreadOnVariableRate1": 1,
    "B-DebtInstrumentInterestRateEffectivePercentage": 4,
    "B-DebtInstrumentInterestRateStatedPercentage": 2,
    "B-LineOfCreditFacilityMaximumBorrowingCapacity": 3,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.40.1",
  "vocab_size": 28996
}
